{
    "Automating My Blog Workflow with Python and Obsidian.md": "### **How It Works** \ndate:2025\n📂 **Step 1: Reads Blog Posts**\n\n- The script scans my **Obsidian Vault’s blog folder** and collects all `.md` files.\n- It stores each file’s content in a dictionary where the **filename** is the key and the **content** is the value.\n\n📜 **Step 2: Creates a JSON Feed**\n\n- It converts the Markdown files into a **JSON file (`blog_posts.json`)**, making them easy to load in my portfolio.\n\n🔍 **Step 3: Watches for Changes**\n\n- Using the `watchdog` library, it **monitors the folder** for any changes.\n- Whenever I modify a post in Obsidian, the script **automatically updates the JSON file**.\n- ",
    "Chess and life.md": "**♟️ Life is Chess, Every Move Matters**\n\n- Life isn’t a game of memorization—like a pre-planned chess match.\n- True mastery comes from understanding where you are and making bold, creative moves.\n- I don’t just follow the game—I shape it.\n\nLife, like chess, is unpredictable. Every choice we make shapes our path.\n\n1. **Take Your Time:**  \n    Rushing can lead to mistakes. In life, like in chess, sometimes the best move is to stop and think before acting.\n    \n2. **Learn from Losses:**  \n    Even the best players lose. Failure isn’t the end—it's a chance to reflect and grow.\n    \n3. **Control Your Emotions:**  \n    Whether in chess or life, letting emotions control you can lead to mistakes. Stay calm, and think clearly.\n    \n4. **Know When to Rest:**  \n    If you’re burned out, take a break. Pushing through when you’re tired only leads to more mistakes. Rest, recharge, and come back stronger.\n    \n5. **Ego vs. Growth:**  \n    Wins feel great, but losses teach us humility. Every experience, good or bad, is part of learning and improving.\n    \n\nLife and chess are about balance—acting when needed, reflecting when necessary, and always growing.\n\n---",
    "file organizer.md": "That is a python code i used to organize my files\nall you have to do is to run it and enter the source path you want to organize \n\nPYTHON:\n\nimport os\n\nfrom pathlib import Path\n\nimport shutil\n\nsource_dir = input('Enter the source directory: ').strip('\"')  # Strip any accidental quotes\n\n  \n\ndef organize_files(source_dir):\n\n    # Define file types\n\n    file_types = {\n\n        'Images': ['.jpg', '.png', '.gif', '.jpeg'],\n\n        'Documents': ['.pdf', '.docx', '.txt', '.xlsx'],\n\n        'Code': ['.py', '.js', '.html', '.css'],\n\n        'Videos': ['.mp4', '.avi', '.mov'],\n\n        'Music': ['.mp3', '.wav', '.flac']\n\n    }\n\n  \n\n    # ✅ Step 1: Create all folders BEFORE scanning files\n\n    for folder in file_types.keys():\n\n        folder_path = os.path.join(source_dir, folder)\n\n        os.makedirs(folder_path, exist_ok=True)  # Ensures folders exist before moving files\n\n  \n\n    # ✅ Step 2: Now, safely scan and move files\n\n    for file_name in os.listdir(source_dir):\n\n        file_path = os.path.join(source_dir, file_name)\n\n  \n\n        if os.path.isfile(file_path):  # Only process files, ignore directories\n\n            file_ext = Path(file_name).suffix.lower()\n\n  \n\n            for folder, extensions in file_types.items():\n\n                if file_ext in extensions:\n\n                    dest_path = os.path.join(source_dir, folder, file_name)\n\n                    try:\n\n                        shutil.move(file_path, dest_path)\n\n                        print(f\"Moved: {file_name} → {folder}\")\n\n                    except FileNotFoundError:\n\n                        print(f\"❌ Error: {file_name} not found. Skipping...\")\n\n  \n\n\n\norganize_files(source_dir)",
    "mental toughness.md": "building mental toughness is about doing everything you must or should do even though it sucks!\nThat is how growth happen : by doing everyday something sucks that you don't want to do \n\nfor me for example training is one of those things and studying also is another thing that i don't want to do\nAnd those things are the most things i need to do because\nthey make me feel bad while doing them but this is the process of being mentally tough\n**-**DO WHAT YOU DON'T WANT TO**  \n**-****IF YOU CAN'T CONTROL YOUR BRAIN AND YOUR BRAIN CONTROLS YOU YOU ARE FUCKED!!**",
    "The School System.md": "\n\n# The School System: A Tool, Not a Trap\n\nWe're told school is about:\n\n✅ Learning valuable knowledge\n✅ Developing important social skills\n✅ Preparing for a successful future\n\nWhile there's some truth to this, the reality is more complex. The system isn't perfect, but it's also not a complete waste of time.  It's a tool, and like any tool, it can be used effectively or ineffectively.\n\n## The Challenges of the System:\n\n🔴 **Varying Relevance:** Some material may feel irrelevant to your personal goals.\n🔴 **Standardized Approach:** The system often prioritizes conformity over creativity.\n🔴 **Focus on Grades:**  The emphasis on grades can overshadow genuine learning.\n🔴 **Uneven Teaching Quality:**  Not all teachers are equally effective or inspiring.\n\n## The Truth About School's Role:\n\nSchool plays a role in societal structures and can be a stepping stone for certain paths (university, specific careers).  However, it doesn't guarantee success or fulfillment.  Real success comes from a combination of formal education, self-directed learning, and real-world experience.\n\n## How to Navigate the System Effectively:\n\n✔ **Strategic Engagement:** Don't expect school to be everything you need.  Identify what's valuable *for you* and focus on those aspects.  Be present, participate, and learn what you can, but don't let the system define your worth or limit your vision.\n\n✔ **Skill Development Beyond the Classroom:**  Prioritize developing skills that align with your passions and goals (coding, business, creative arts, etc.).  These skills will set you apart and empower you to create your own opportunities.\n\n✔ **Seek Mentors and Connections:** Build relationships with teachers, professionals, and peers who can inspire and support you.  Networking is essential.\n\n✔ **Embrace Lifelong Learning:**  Recognize that learning doesn't stop after graduation.  Cultivate a love of learning and constantly seek new knowledge and skills.\n\n✔ **Balance \"Playing the Game\" and \"Building Your Own Game\":**  Strive for a balance between achieving academic success (grades, degrees) and pursuing your own projects and passions.  Good grades can open doors, but real-world skills and experience are what will truly make you successful.\n\n✔ **Find Your \"Why\":**  Clarify your personal motivations for pursuing education and your long-term goals.  This will help you stay focused and make strategic decisions.\n\n## The Final Thought: You Are the Architect of Your Future\n\nSchool can be a valuable part of your journey, but *you* are the architect of your future.  Don't let the system define you.  Use it strategically, focus on developing your skills, and pursue your passions relentlessly.  Your potential is limitless.  It's up to you to unlock it. 🚀",
    "C:\\Users\\yousi\\OneDrive\\المستندات\\Obsidian Vault\\blog\\Untitled.md": {
        "status": "modified",
        "content": ""
    }
}