{
    "Automating My Blog Workflow with Python and Obsidian.md": "### **How It Works** \ndate:2025\n📂 **Step 1: Reads Blog Posts**\n\n- The script scans my **Obsidian Vault’s blog folder** and collects all `.md` files.\n- It stores each file’s content in a dictionary where the **filename** is the key and the **content** is the value.\n\n📜 **Step 2: Creates a JSON Feed**\n\n- It converts the Markdown files into a **JSON file (`blog_posts.json`)**, making them easy to load in my portfolio.\n\n🔍 **Step 3: Watches for Changes**\n\n- Using the `watchdog` library, it **monitors the folder** for any changes.\n- Whenever I modify a post in Obsidian, the script **automatically updates the JSON file**.\n- ",
    "mental toughness.md": "building mental toughness is about doing everything you must or should do even though it sucks!\nThat is how growth happen : by doing everyday something sucks that you don't want to do \n\nfor me for example training is one of those things and studying also is another thing that i don't want to do\nAnd those things are the most things i need to do because\nthey make me feel bad while doing them but this is the process of being mentally tough\n**-**DO WHAT YOU DON'T WANT TO**  \n**-****IF YOU CAN'T CONTROL YOUR BRAIN AND YOUR BRAIN CONTROLS YOU YOU ARE FUCKED!!**",
    "The Harsh Truth About School & How to Escape the System.md": "\n\n### **1. The Illusion of School**\n\nThey tell us that school is about:  \n✅ Learning valuable knowledge  \n✅ Becoming polite and well-mannered  \n✅ Preparing for a successful future\n\nBut the reality? **It’s a factory designed to control you.**\n\n### **2. Why School Fails Us**\n\n🔴 **Wasted Time:** We spend **16+ years** memorizing things we could learn in months if we actually needed them.  \n🔴 **Fake Discipline:** How can we learn politeness when teachers yell, insult, and even hit students?  \n🔴 **A System That Kills Creativity:** Thinking differently isn’t rewarded—it’s ignored, mocked, or shut down.  \n🔴 **Toxic Social Games:** Instead of real teamwork, students compete for grades, popularity, and approval.\n\n### **3. The Truth About School’s Purpose**\n\nLet’s be honest: **School isn’t about learning.** It’s a **tool for reaching a specific social position.**\n\n- If you want a job, you need a degree.\n- If you want to marry into a certain social class, you need the right education level.\n- But if you want **real success and impact**, it won’t come from just following this system.\n\n### **4. How to Escape the Trap (Mentally & Strategically)**\n\n✔ **Stop expecting school to be \"fair\" or \"useful.\"** Use it as a tool, but don’t let it define your future.  \n✔ **See classmates for what they are:** Most of them are stuck in the social game—you don’t need to be.  \n✔ **Play the system, but build your own path:** Get the necessary degree, but focus on **real skills like coding, business, and independent thinking.**  \n✔ **Understand that different goals require different actions.** If you want an extraordinary life, you must take **an extraordinary path.**\n\n### **5. The Final Thought: School Doesn’t Decide Your Future—You Do**\n\nMost people let school shape their minds, their future, and their self-worth. But you don’t have to.\n\nYou have two choices:  \n1️⃣ **Be another person stuck in the system, competing for grades and approval.**  \n2️⃣ **Use the system while building your own path to greatness.**\n\n**Which one will you choose?** 🚀"
}